Revit 2027 API
SizingUIUtils Class
 Contains the utility methods in MEP sizing operations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.SizingUIUtils
Namespace: Autodesk.Revit.UI
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class SizingUIUtils
Public NotInheritable Class SizingUIUtils
public ref class SizingUIUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type SizingUIUtils = class end
See Also
Reference
Autodesk.Revit.UI Namespace